# -*- coding:utf-8 -*-
import random

heros = ['暗黑元首', '暗夜猎手', '暗裔剑魔', '傲之追猎者', '暴怒骑士', '暴走萝莉', '爆破鬼才', '北地之怒', '冰晶凤凰', '冰霜女巫', '不灭狂雷', '不屈之枪', '不详之刃', '残月之肃', '潮汐海灵', '惩戒之箭', '翠神', '大发明家', '刀锋舞者', '刀锋之影', '德邦总管', '德玛西亚皇子', '德玛西亚之力', '德玛西亚之翼', '涤魂圣枪', '堕落天使', '恶魔小丑', '发条魔灵', '法外狂徒', '放逐之刃', '风暴之怒', '封魔剑魂', '费雷尔卓德之心', '符文法师', '复仇焰魂', '复仇之矛', '光辉女郎', '诡术妖姬', '海兽祭祀', '海洋之灾', '含羞蓓蕾', '寒冰射手', '河流之王', '黑暗之女', '幻翎', '唤潮鲛姬', '荒漠屠夫', '魂锁典狱长', '机械公敌', '机械先驱', '疾风剑豪', '皎月女神', '解脱者', '荆棘之兴', '九尾妖狐', '酒桶', '巨魔之王', '卡牌大师', '狂暴之心', '狂野女猎手', '狂战士', '离群之刺', '炼金术士', '灵罗娃娃', '龙血武姬', '麦林炮手', '蛮族之王', '盲僧', '迷失之牙', '魔法猫咪', '魔蛇之拥', '牧魂人', '暮光星灵', '暮光之眼', '逆羽', '牛头酋长', '扭曲树精', '诺克萨斯统领', '诺克萨斯之手', '披甲龙龟', '皮城女警', '皮城执法官', '破败之王', '齐天大圣', '琴瑟仙女', '青钢影', '荣耀行刑官', '熔岩巨兽', '熔铁少女', '沙漠皇帝', '沙漠玫瑰', '沙漠死神', '山隐之焰', '殇之木乃伊', '赏金猎人', '深海泰坦', '深渊巨口', '生化魔人', '圣锤之毅', '圣枪游侠', '时光守护者', '时间刺客', '兽灵行者', '曙光女神', '水晶先锋', '死亡颂唱者', '探险家', '天启者', '铁铠冥魂', '痛苦之拥', '瓦罗兰之盾', '万花通灵', '腕豪', '亡灵战神', '未来守护者', '瘟疫之源', '无极剑圣', '无双剑姬', '无畏战车', '武器大师', '戏命师', '仙灵女巫', '邪恶小法师', '星界游神', '星籁歌姬', '猩红收割者', '虚空遁地兽', '虚空恐惧', '虚空掠夺者', '虚空先知', '虚空行者', '虚空之女', '虚空之眼', '雪原双子', '血港鬼影', '迅捷斥候', '岩雀', '英勇投弹手', '影流之镰', '影流之主', '永恒梦魇', '永猎双子', '元素女皇', '远古恐惧', '远古巫灵', '战争女神', '战争之影', '蒸汽机器人', '正义巨像', '正义天使', '蜘蛛女皇', '众星之子', '铸星龙王', '祖安狂人', '祖安怒兽']

pool = 15
a = random.sample(heros, 15*2)

for i in range(0, len(a), pool):
    print(a[i:i+pool])
